bases/WIM_FIn/projects/IMDEV-7330 Оптимизация 1С ФИН_Расчет НДФЛ/Расширения/IMDEV7330_Locks/DataProcessors/ФормированиеНачисленийНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормированиеНачисленийНДФЛ</Name>
		</Properties>
	
		<ChildObjects>
		
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантЗаполнения</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>1</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйПериод</Name>
					<Type><v8:Type>cfg:CatalogRef.Периоды</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыБезУдержаний</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыПоКлиентамБезЦБ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиПо</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиС</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Период</Name>
					<Type><v8:Type>v8:StandardPeriod</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоздаватьОплатуНДФЛ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СхемаВыплаты</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>1</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетДляОплатыНалогов</Name>
					<Type><v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УправляющаяКомпания</Name>
					<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияПоЗакрытымПортфелям</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПоЗакрытымПортфелямСПоступлениемНКД</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Дата</Name>
							<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УправляющаяКомпания</Name>
							<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Клиент</Name>
							<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СхемаРеинвестирования</Name>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>20</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-7330 Оптимизация 1С ФИН_Расчет НДФЛ/Расширения/IMDEV7330_Locks/DataProcessors/ФормированиеНачисленийНДФЛ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("ЗаполнитьДатыДокументов")
Процедура IMDEV7330_Locks_ЗаполнитьДатыДокументов() Экспорт
	
	ДатыДокументов.Очистить();
	
	Если ВариантЗаполнения = 1 Тогда
		ЗаполнитьПоОборотамСчета79_01();
	ИначеЕсли ВариантЗаполнения = 0 Тогда
		ЗаполнитьПоСуществующимНачислениямНДФЛ();
	ИначеЕсли ВариантЗаполнения = 2 Тогда
		ЗаполнитьДокументамиНаДату();
	ИначеЕсли ВариантЗаполнения = 3 Тогда
		ЗаполнитьДаннымиСтороннихСистем();
	#Вставка
	ИначеЕсли ВариантЗаполнения = 4 Тогда
		ЗаполнитьПоОтсутствующимНачислениямНДФЛ();
	#КонецВставки
	КонецЕсли;	
	
КонецПроцедуры

// Описание: Заполняет ТЧ ДатыДокументов парами (Клиент, УК) на конец периода, по которым
//           нет ни одного проведённого начисления НДФЛ по портфелю или по УК
//           (кроме документов с основанием ПуловоеНачислениеДивидендов).
//           Кандидаты совпадают с вариантом заполнения 2 (ЗаполнитьДокументамиНаДату).
//
Процедура ЗаполнитьПоОтсутствующимНачислениямНДФЛ() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыплатаДоходаСрезПоследних.Портфель.УправляющаяКомпания КАК УправляющаяКомпания,
		|	ВыплатаДоходаСрезПоследних.Портфель.Клиент КАК Клиент,
		|	МАКСИМУМ(ВыплатаДоходаСрезПоследних.ВыплатаДохода) КАК ВыплатаДохода
		|ПОМЕСТИТЬ ВТ_ВыплатаДохода
		|ИЗ
		|	РегистрСведений.ВыплатаДохода.СрезПоследних(
		|			&КонецПериода,
		|			ВЫБОР
		|					КОГДА &ОтборПоКлиенту
		|						ТОГДА Портфель.Клиент = &Клиент
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ОтборПоУК
		|						ТОГДА Портфель.УправляющаяКомпания = &УК
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ВыплатаДоходаСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыплатаДоходаСрезПоследних.Портфель.УправляющаяКомпания,
		|	ВыплатаДоходаСрезПоследних.Портфель.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НДФЛСведенияОДоходахОбороты.Портфель.Клиент КАК Клиент,
		|	НДФЛСведенияОДоходахОбороты.Портфель.УправляющаяКомпания КАК УправляющаяКомпания,
		|	&КонецПериода КАК Дата,
		|	СУММА(НДФЛСведенияОДоходахОбороты.СуммаДоходаОборот) КАК СуммаДоходаОборот
		|ПОМЕСТИТЬ ВТ_УККлиенты
		|ИЗ
		|	РегистрНакопления.НДФЛСведенияОДоходах.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			День,
		|			&ПоПортфелямСДвижениямиПоНДФЛ
		|				И ВЫБОР
		|					КОГДА &ОтборПоКлиенту
		|						ТОГДА Клиент = &Клиент
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ОтборПоУК
		|						ТОГДА УправляющаяКомпания = &УК
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК НДФЛСведенияОДоходахОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НДФЛСведенияОДоходахОбороты.Портфель.Клиент,
		|	НДФЛСведенияОДоходахОбороты.Портфель.УправляющаяКомпания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХозрасчетныйОбороты.Портфель.Клиент,
		|	ХозрасчетныйОбороты.Портфель.УправляющаяКомпания,
		|	&КонецПериода,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборот)
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Счет В (&Счет_68_01),
		|			,
		|			&ПоПортфелямСДвижениямиПоНДФЛ
		|				И ВЫБОР
		|					КОГДА &ОтборПоКлиенту
		|						ТОГДА Портфель.Клиент = &Клиент
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ОтборПоУК
		|						ТОГДА Портфель.УправляющаяКомпания = &УК
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ,
		|			,
		|			) КАК ХозрасчетныйОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.Портфель.Клиент,
		|	ХозрасчетныйОбороты.Портфель.УправляющаяКомпания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Портфели.Клиент,
		|	Портфели.УправляющаяКомпания,
		|	&КонецПериода,
		|	NULL
		|ИЗ
		|	Справочник.Портфели КАК Портфели
		|ГДЕ
		|	НЕ &ПоПортфелямСДвижениямиПоНДФЛ
		|	И ВЫБОР
		|			КОГДА &ПоЗакрытымПортфелям
		|				ТОГДА Портфели.ДатаОкончания >= &НачалоПериода
		|						ИЛИ Портфели.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИНАЧЕ Портфели.ДатаОкончания >= НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
		|					ИЛИ Портфели.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоКлиенту
		|				ТОГДА Портфели.Клиент = &Клиент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоУК
		|				ТОГДА Портфели.УправляющаяКомпания = &УК
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И Портфели.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
		|	И Портфели.Клиент.ДатаСмерти = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ Портфели.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачислениеНДФЛПоПортфелю.Портфель.Клиент КАК Клиент,
		|	НачислениеНДФЛПоПортфелю.Портфель.УправляющаяКомпания КАК УправляющаяКомпания
		|ПОМЕСТИТЬ ВТ_УжеРассчитаны
		|ИЗ
		|	Документ.НачислениеНДФЛПоПортфелю КАК НачислениеНДФЛПоПортфелю
		|ГДЕ
		|	НачислениеНДФЛПоПортфелю.Проведен
		|	И (ВЫРАЗИТЬ(НачислениеНДФЛПоПортфелю.ДокументОснование.Ссылка КАК Документ.ПуловоеНачислениеДивидендов) ЕСТЬ NULL
		|			ИЛИ (ВЫРАЗИТЬ(НачислениеНДФЛПоПортфелю.ДокументОснование.Ссылка КАК Документ.ПуловоеНачислениеДивидендов)) = ЗНАЧЕНИЕ(Документ.ПуловоеНачислениеДивидендов.ПустаяСсылка))
		|	И НачислениеНДФЛПоПортфелю.Дата МЕЖДУ &НачалоПериодаДокументов И &КонецПериода
		|	И ВЫБОР
		|			КОГДА &ОтборПоУК
		|				ТОГДА НачислениеНДФЛПоПортфелю.Портфель.УправляющаяКомпания = &УК
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоКлиенту
		|				ТОГДА НачислениеНДФЛПоПортфелю.Портфель.Клиент = &Клиент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачислениеНДФЛПоУправляющейКомпании.Клиент,
		|	НачислениеНДФЛПоУправляющейКомпании.УправляющаяКомпания
		|ИЗ
		|	Документ.НачислениеНДФЛПоУправляющейКомпании КАК НачислениеНДФЛПоУправляющейКомпании
		|ГДЕ
		|	НачислениеНДФЛПоУправляющейКомпании.Проведен
		|	И (ВЫРАЗИТЬ(НачислениеНДФЛПоУправляющейКомпании.ДокументОснование.Ссылка КАК Документ.ПуловоеНачислениеДивидендов) ЕСТЬ NULL
		|			ИЛИ (ВЫРАЗИТЬ(НачислениеНДФЛПоУправляющейКомпании.ДокументОснование.Ссылка КАК Документ.ПуловоеНачислениеДивидендов)) = ЗНАЧЕНИЕ(Документ.ПуловоеНачислениеДивидендов.ПустаяСсылка))
		|	И НачислениеНДФЛПоУправляющейКомпании.Дата МЕЖДУ &НачалоПериодаДокументов И &КонецПериода
		|	И ВЫБОР
		|			КОГДА &ОтборПоУК
		|				ТОГДА НачислениеНДФЛПоУправляющейКомпании.УправляющаяКомпания = &УК
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоКлиенту
		|				ТОГДА НачислениеНДФЛПоУправляющейКомпании.Клиент = &Клиент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Клиент,
		|	УправляющаяКомпания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_УККлиенты.Клиент КАК Клиент,
		|	ВТ_УККлиенты.УправляющаяКомпания КАК УправляющаяКомпания,
		|	ВТ_УККлиенты.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ВыплатаДохода.ВыплатаДохода, ЛОЖЬ)
		|			ТОГДА ""Выплата дохода""
		|		ИНАЧЕ ""Реинвестирование""
		|	КОНЕЦ КАК СхемаРеинвестирования
		|ИЗ
		|	ВТ_УККлиенты КАК ВТ_УККлиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыплатаДохода КАК ВТ_ВыплатаДохода
		|		ПО ВТ_УККлиенты.Клиент = ВТ_ВыплатаДохода.Клиент
		|			И ВТ_УККлиенты.УправляющаяКомпания = ВТ_ВыплатаДохода.УправляющаяКомпания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УжеРассчитаны КАК ВТ_УжеРассчитаны
		|		ПО ВТ_УККлиенты.Клиент = ВТ_УжеРассчитаны.Клиент
		|			И ВТ_УККлиенты.УправляющаяКомпания = ВТ_УжеРассчитаны.УправляющаяКомпания
		|ГДЕ
		|	ВТ_УжеРассчитаны.Клиент ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА &СхемаВыплаты = 1
		|				ТОГДА ВТ_ВыплатаДохода.ВыплатаДохода = ЛОЖЬ
		|						ИЛИ ВТ_ВыплатаДохода.ВыплатаДохода ЕСТЬ NULL
		|			КОГДА &СхемаВыплаты = 2
		|				ТОГДА ВТ_ВыплатаДохода.ВыплатаДохода = ИСТИНА
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_УККлиенты.Клиент.Наименование";

	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("НачалоПериодаДокументов", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ОтборПоУК", ЗначениеЗаполнено(УправляющаяКомпания));
	Запрос.УстановитьПараметр("УК", УправляющаяКомпания);
	Запрос.УстановитьПараметр("ОтборПоКлиенту", ЗначениеЗаполнено(Клиент));
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Счет_68_01", ПланыСчетов.Хозрасчетный.СчетаПоСтроке("68.01"));
	Запрос.УстановитьПараметр("ПоПортфелямСДвижениямиПоНДФЛ", ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ);
	Запрос.УстановитьПараметр("ПоЗакрытымПортфелям", ФормироватьНачисленияПоЗакрытымПортфелям);
	Запрос.УстановитьПараметр("СхемаВыплаты", СхемаВыплаты);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(Запрос, "ЗаполнитьПоОтсутствующимНачислениямНДФЛ");

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ДатыДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
